app/controllers/order_items_controller.rb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
INSERT INTO "order_items" ("quantity", "product_id", "order_id") VALUES ($1, $2, $3) RETURNING "id"  [["quantity", 1], ["product_id", 1], ["order_id", 1]]
INSERT INTO "orders" ("total_price") VALUES ($1) RETURNING "id"  [["total_price", "48.62"]]
---
  def create
    @order = current_order
    @item = @order.order_items.new(item_params)
    @order.save

UPDATE "orders" SET "total_price" = $1 WHERE "orders"."id" = $2  [["total_price", "246.3"], ["id", 1]]
---
  def destroy
    @order = current_order
    @item = @order.order_items.find(params[:id])
    @item.destroy
    @order.save